{
    "title": "Time Management Is About More Than Life Hacks",
    "description": "There is certainly no shortage of advice — books and blogs, hacks and apps — all created to boost time management with a bevy of ready-to-apply tools. Yet, the frustrating reality for individuals trying to improve their time management is that tools alone won’t work....more",
    "content": "Project creep, slipping deadlines, and a to-do list that seems to get longer each day — these experiences are all too common in both life and work. With the New Year’s resolution season upon us, many people are boldly trying to fulfill goals to “manage time better,” “be more productive,” and “focus on what matters.” Development goals like these are indeed important to career success. Look no further than large-scale surveys that routinely find time management skills among the most desired workforce skills, but at the same time among the rarest skills to find.\nSo how do we become better time managers? There is certainly no shortage of advice — books and blogs, hacks and apps, all created to boost time management with a bevy of ready-to-apply tools. Yet, the most frustrating reality for individuals trying to improve their time management is that no matter how effectively designed these tools might be, they are unlikely to work. Simply put, these tools presume a person’s underlying skill set, but the skills comprising time management precede the effectiveness of any tool or app. For example, would anyone seriously expect that purchasing a good set of knives, high-end kitchen equipment, and fresh ingredients would instantly make someone a five-star chef? Certainly not. Similarly, using a scheduling app without the prerequisite time management skills is unlikely to produce positive time management outcomes.\nFortunately, there is a wealth of research that delves into the skills that undergird time management. Here, time management is defined as the decision-making process that structures, protects, and adjusts a person’s time to changing environmental conditions. Three particular skills separate time management success from failure:\nOf these three skills, arrangement is probably the most familiar, especially considering that the majority of apps and hacks deal with scheduling and planning. However, there isn’t the same widespread recognition of awareness and adaptation skills. This raises key questions about how these skills play out from a developmental perspective: Are they equally important? Are some more difficult for people to master? And, are some rarer than others?\nMeasuring Time Management Skills\nTo answer these questions, I examined the results from more than 1,200 people who participated in a 30-minute microsimulation designed to objectively assess time management skills. Participants were given the role of a freelance designer, and they had to manage tasks and relationships with clients and colleagues within a communication platform complete with emails, instant messages, cloud drive files, and so forth. Problems they had to confront included dealing with scheduling conflicts, prioritizing client demands, and deciding how to use (or not use) their time.\nThe evidence revealed several compelling findings.\nFirst, all three skills mattered equally to overall time management performance. Therefore, only improving one’s scheduling and planning (for example, arrangement skills) ignores two-thirds of the competence needed to effectively manage time. This might explain why it’s so disappointing to try a new tool and then feel like we’ve never really moved the needle toward being great overall time managers.\nSecond, people struggled the most with awareness and adaptation skills, where assessment scores were on average 24% lower than for arrangement skills. This evidence suggests that awareness and adaptation are not only rarer skills but more difficult to develop naturally without direct interventions. In addition, awareness skills were the primary driver of how well people avoided procrastination, and adaptation skills were the primary driver of how well they prioritized activities.\nThird, the results ran counter to popular admonitions of either the virtues or the detriments of multitasking. A survey after the simulation asked how respondents felt about multitasking. The evidence revealed that their preferences for multitasking (what academics call “polychronicity”) were actually unrelated to time management skills. How well or poorly people managed their time had nothing to do with their preferences to multitask. Thus, the extensive attention so often given to multitasking by those offering time management tricks is unlikely to yield any real success.\nFourth, the evidence was crystal clear that people are not at all accurate in self-evaluating their time management proficiency. For example, less than 1% of people’s self-ratings overlapped with their objective skill scores. Moreover, self-ratings accounted for only about 2% of differences in actual time management skills. These results echo previous work on people’s lack of accurate self-awareness regarding their competencies and how this impedes change and leadership development.\nHow to Improve Your Time Management Skills\nSo how might people best prepare themselves to become better time managers? Doing so first requires figuring out where to focus. Taking a deeper dive into your current skill levels is the only genuine way to answer this question. There are three steps you can take to prime your improvement efforts.\nBuild accurate self-awareness of your time management skills.\nThis can be accomplished by using objective assessments like a microsimulation, seeking feedback from others like one’s peers or boss, or establishing a baseline of behaviors against which to gauge improvements.\nRecognize that preferences matter, but not how you think.\nSelf-awareness of one’s preferences or personality related to time management, such as multitasking or being proactive, can deepen an understanding of where you might struggle as your change efforts go against existing habits. But remember that skills, not personality, are the most malleable personal attributes and provide the greatest ROI on self-improvement efforts.\nIdentify and prioritize the skill you need to improve.\nAlthough this sounds obvious, the key point here is to avoid self-improvement that is an “inch deep, but a mile wide,” where efforts are spread too thin across too many needs. It is best to prioritize your skill development, focusing on the most pressing skill need first and then moving on to the next.\nThere are a number of evidence-based tactics for enhancing time management skills. Below are some examples. Again, it is critical to understand that tactics are for developing your underlying skills, which will ultimately improve your time management. Simply implementing these tactics is not the end goal.\nDeveloping awareness skills.\nEffectiveness is different from efficiency, with effectiveness being about doing things well and efficiency being about doing things fast. Both are critical. Pursuing efficiency for its own sake is counterproductive.\nDeveloping arrangement skills.\nUnfamiliar but important tasks often have steeper learning curves and more unpredictable time requirements. Developing arrangement skills is not about organizing your work to better control your life — it’s about taking control of your life, then structuring your work around it.\nDeveloping adaptation skills.\nThese skills are tested and developed in situations that naturally involve high pressure and sometimes even crisis — the challenge is to handle such situations without getting upset, anxious, or distracted.\nIn this season of personal introspection, why does improving time management remain such a persistent, perennial goal for so many of us? The irony is that we need to become better time managers of our own efforts to improve time management — to prioritize our developmental efforts. This path begins with turning away from the alluring quick fixes and instead toward assessing and building our underlying time management skills before another New Year’s resolution reaches its dissolution."
}